In [1]:
import pandas as pd

In [2]:
s = pd.Series(['pizza', 42])

In [3]:
type(s)

pandas.core.series.Series

In [4]:
s

0    pizza
1       42
dtype: object

In [5]:
s = pd.Series(['pizza', 42], index=['food', 'number'])

In [6]:
s

food      pizza
number       42
dtype: object

In [7]:
s.loc['food']

'pizza'

In [8]:
s.iloc[0]

'pizza'

In [9]:
scientists = pd.DataFrame({
    'Name': ['Frank', 'Gus'],
    'Job': ['chem', 'stats']
})

In [10]:
scientists

    Name    Job
0  Frank   chem
1    Gus  stats

In [11]:
type(scientists)

pandas.core.frame.DataFrame

In [12]:
scientists = pd.read_csv('../data/scientists.csv')

In [13]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [14]:
scientists['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [15]:
scientists['age_doubled'] = scientists['Age'] * 2

In [16]:
scientists.head()

,Name,Born,Died,Age,Occupation,age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112